#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.access will be created
  + resource "aws_eks_access_entry" "access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "easy-food-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "pos-tech",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::471112648522:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.access_policy will be created
  + resource "aws_eks_access_policy_association" "access_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "easy-food-eks"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::471112648522:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_cluster.easy-food-eks will be created
  + resource "aws_eks_cluster" "easy-food-eks" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "easy-food-eks"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::471112648522:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.27"

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-000935136986ff5b7",
            ]
          + subnet_ids                = [
              + "subnet-03590703377fac860",
              + "subnet-08e1e83f7a2ce4f17",
              + "subnet-0ad1def8daf2f88ee",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.node_group will be created
  + resource "aws_eks_node_group" "node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "easy-food-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "node-group-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::471112648522:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03590703377fac860",
          + "subnet-08e1e83f7a2ce4f17",
          + "subnet-0ad1def8daf2f88ee",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 5
          + min_size     = 3
        }

      + update_config {
          + max_unavailable = 3
        }
    }

  # module.eks.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "easy-food-nginx"
      + namespace                  = "nginx-ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "4.10.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.eks.kubernetes_namespace.nginx-ingress will be created
  + resource "kubernetes_namespace" "nginx-ingress" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Rodrigo1895, Action: `pull_request`*